---
kind: type
id: T:Autodesk.Revit.Exceptions.FileArgumentNotFoundException
source: html/ca9ccaa9-ed08-d40d-31a7-1af3ad2dcb84.htm
---
# Autodesk.Revit.Exceptions.FileArgumentNotFoundException

The exception that is thrown when a method received a filename as an argument and requires it to exist as a precondition.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class FileArgumentNotFoundException : ArgumentException
```